enthalpyBased_NSCBC2/0/T.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
300
(
274.69
274.69
274.69
274.69
274.69
274.69
274.69
274.69
...
)
;

boundaryField
{
    sideLeft
    {
        type            zeroGradient;
    }
    sideRight
    {
        type            zeroGradient;
    }
    topbottom
    {
        type            empty;
    }
    frontback
    {
        type            empty;
    }
}


// ************************************************************************* //
