enthalpyBased_NSCBC2/0/k.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-5;

boundaryField
{
    sideLeft
    {
        type            zeroGradient;
    }

    sideRight
    {
        type            fixedValue;
	value           $internalField;
    }
    topbottom
    {
     	type            empty;
    }
    frontback
    {
     	type            empty;
    }    	
    //defaultFaces
    //{
        //type            empty;
    //}
}

// ************************************************************************* //
